= 个人记录 =
不断的提高自己
需要学习的东西太多了 
很多基础的东西都不是很熟练

!!! 如何做好时间管理 !!!
做什么事都想很快的做完 一旦遇到挫折就容易放弃
花费在游戏上的时间是否合理

应该多去想想怎么优化代码 而不是简单的做完工作
怎样才能对团队做出贡献 提高自己的价值

== 近期要做的事情 ==

== 坚持要做的事情 ==
- 至少每周都要学懂一篇Ted Talk的视频，记录笔记，可以每天反复观看，加强记忆
- 尽量每天都看会书吧

== trivial things ==

== 想要学的东西 ==
* [ ] 跟着cppcon再巩固下modern c++的基础 现在的项目用的是c98啊 暂时搁置吧
* [ ] 编译原理
* [ ] 汇编
* [ ] 坚持看一些开源代码

== Work == 
工作 [[work/pwrd/TODO]]

== Warning ==
1. 最近看的技术的视频 总是没有耐心看完 有些就是因为英文不好导致一些东西没看进去 才弃的 这样很不好
有一些技术本来就是不会的 过程中肯定会有不懂的东西 对于不懂的东西 一定要多查并且坚持看完 才有可能懂
back to basic: The Abstract Machine 就没有看完 主要也是主讲人跟那读ppt很没意思
2. 我觉得现在最欠缺的就是系统的补充知识，总是这查一点那看一点的，知识不成体系，
所以还是看书比较好一些，网上查阅资料还是更适用于具体的问题

== 总结 ==
[[./personal/go]] -> go的一些总结,遇到的问题等
[[./personal/wsl]] -> wsl的一些问题
[[./personal/vue]] -> 使用vue遇到的问题
[[./personal/system]] -> 系统知识
[[./personal/vim]] -> vim遇到的问题,知识
[[./personal/terminal]] -> terminal相关
[[./personal/gdb]] -> gdb相关
[[./personal/cpp]] -> c++问题

